1. Given a sample list, tuple and a set with elements as numbers from 1-10. Convert each of the data types into a pandas series. Create a separate list of index values for the series.

In [2]:
import pandas as pd

In [17]:
#list - ordered
#tuple - ordered
#set - unordered

list1 = [1,2,3,4,5,6,7,8,9,10]
tup1 = (1,2,3,4,5,6,7,8,9,10)
set1 = {1,2,3,4,5,6,7,8,9,10}
#set1[5]

In [15]:
series1 = pd.Series(list1,index = ['a','b','c','d','e','f','g','h','i','j'])
series1

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [16]:
series1 = pd.Series(tup1,index = ['a','b','c','d','e','f','g','h','i','j'])
series1

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [7]:
series1 = pd.Series(set1)
series1

TypeError: 'set' type is unordered

2. Create a python dictionary with three key value pairs. Keep the keys as the first names, and the respective last names as values in the dictionary. Use the dictionary to create a pandas series.

In [18]:
dict1 ={'Tarun':'Soni','Ranbir':'Kapoor','Rishab':'Singh'}
dict1

{'Tarun': 'Soni', 'Ranbir': 'Kapoor', 'Rishab': 'Singh'}

In [19]:
series4 = pd.Series(dict1)
series4

Tarun       Soni
Ranbir    Kapoor
Rishab     Singh
dtype: object

In [20]:
print(type(series4))

<class 'pandas.core.series.Series'>

3. Create a pandas series, with the elements as numbers from 1-10. Use the index values starting from 0-10. For the above series:
    
    a. Convert it to a list.
    
    b. Convert it to a dictionary.
    
    c. Convert it to a tuple. 
    
    d. Convert it to a set.

In [23]:
#unordered(set) - ordered(Series) cannot be done
#ordered(Series) - unordered(set) can be done

series5 = pd.Series(range(1,11))
series5

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [24]:
l1 = list(series5)
l1

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [25]:
t1 = tuple(series5)
t1

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [26]:
d1 = dict(series5)
d1

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

In [27]:
s1 = set(series5)
s1

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

4. Create a sample pandas series with x integer elements. Perform the following operations on the same:
    
    a. Print the first 5 elements of the series
    
    b. Print the last 5 elements of the series
    
    c. Insert an integer value ‘50’ at the index 5.
    
    d. Update the last element in the series with the value 100.
    
    e. Delete the first element from the series.

In [33]:
var = [11,22,33,44,55,66,77,88,99]
var[2]

33

In [34]:
var[2:6]

[33, 44, 55, 66]

In [35]:
var[4:8]

[55, 66, 77, 88]

In [36]:
var[2:]

[33, 44, 55, 66, 77, 88, 99]

In [39]:
var[:-2]

[11, 22, 33, 44, 55, 66, 77]

In [40]:
var[::-1]

[99, 88, 77, 66, 55, 44, 33, 22, 11]

In [82]:
series6 = pd.Series([10,11,22,33,44,55,66,77,88,99,100,45])
series6

0      10
1      11
2      22
3      33
4      44
5      55
6      66
7      77
8      88
9      99
10    100
11     45
dtype: int64

In [83]:
#a. Print the first 5 elements of the series
series6[0:5]

0    10
1    11
2    22
3    33
4    44
dtype: int64

In [84]:
#b. Print the last 5 elements of the series
series6[-5:]

7      77
8      88
9      99
10    100
11     45
dtype: int64

In [85]:
#c. Insert an integer value ‘50’ at the index 5.
series6[5] = 50
series6

0      10
1      11
2      22
3      33
4      44
5      50
6      66
7      77
8      88
9      99
10    100
11     45
dtype: int64

In [90]:
#d. Update the last element in the series with the value 100.
series6[11] = 100
series6

0      10
1      11
2      22
3      33
4      44
5      50
6      66
7      77
8      88
9      99
10    100
11    100
dtype: int64

In [86]:
#or this methodinsert
l2 = list(series6)
l2.insert(11,100)
series7 =pd.Series(l2)
series7

0      10
1      11
2      22
3      33
4      44
5      50
6      66
7      77
8      88
9      99
10    100
11    100
12     45
dtype: int64

In [61]:
#Negative Indexing
H  e  l  l  o
-5 -4 -3 -2 -1

SyntaxError: invalid syntax (32908676.py, line 2)

In [62]:
var = "Hello"
var[-3]

'l'

In [52]:
#var[start:end]
var[-4:-1]

'ell'

In [75]:
#e. Delete the first element from the series.

In [91]:
series6.drop(0)

1      11
2      22
3      33
4      44
5      50
6      66
7      77
8      88
9      99
10    100
11    100
dtype: int64

5. For a given pandas series obtained in the 4th step. Write a sample code to find the element 100 in the series.

In [92]:
for i in series6:
    if i == 100:
        print("Yes, 100 is present in the series")

Yes, 100 is present in the series
Yes, 100 is present in the series

6. For the given series A and B, perform concatenation on the same.

series_A = pd.Series([1,2,3,4,5])

series_B = pd.Series([6,7,8,9,10])

In [99]:
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])
#print(series_A)
#print(series_B)

In [100]:
pd.concat((series_A,series_B),ignore_index = True)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

7. Using loops in python, print all the elements within a pandas series.

Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [101]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])
Sample

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [106]:
for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

8. For a given nested list and a sample dictionary, create two data frames using pandas.

List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]

Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [108]:
List = [['AA','BB','CC'],['DD','EE','FF'], ['GG','HH','II']]
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [109]:
df1 = pd.DataFrame(List)
df1

    0   1   2
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II

In [110]:
df1 = pd.DataFrame(Dictionary)
df1

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

9. Create a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following operations on the same.

a. Print the first 3 rows of the Data Frame .

b. Print the rows that have the age greater than 15.

c. Insert 5 imaginary names and ages as values to the pandas Data Frame . 

d. Update the 5th row so that the name = john and age=56.

e. Delete the first row from the Data Frame .

In [114]:
data = [['Aakash',12],['Tanvi',22],['Rohan',27],['Sudarsan',23]]
df3 = pd.DataFrame(data,columns=['Name','Age'])
df3

       Name  Age
0    Aakash   12
1     Tanvi   22
2     Rohan   27
3  Sudarsan   23

In [115]:
df3[0:3]

     Name  Age
0  Aakash   12
1   Tanvi   22
2   Rohan   27

In [116]:
df3[df3.Age > 15]

       Name  Age
1     Tanvi   22
2     Rohan   27
3  Sudarsan   23

In [117]:
df3.loc[4] = ['Murthy',28] 
df3

       Name  Age
0    Aakash   12
1     Tanvi   22
2     Rohan   27
3  Sudarsan   23
4    Murthy   28

In [118]:
df3.loc[4,'Name'] = 'John'
df3.loc[4,'Age'] = 56

In [119]:
df3

       Name  Age
0    Aakash   12
1     Tanvi   22
2     Rohan   27
3  Sudarsan   23
4      John   56

In [120]:
df3.drop(0)

       Name  Age
1     Tanvi   22
2     Rohan   27
3  Sudarsan   23
4      John   56

10. For the Data Frame obtained from step 9, convert the same to a list and a dictionary respectively.

In [122]:
l3 = list(df3.values)
l3

[array(['Aakash', 12], dtype=object),
 array(['Tanvi', 22], dtype=object),
 array(['Rohan', 27], dtype=object),
 array(['Sudarsan', 23], dtype=object),
 array(['John', 56], dtype=object)]

In [123]:
d3 = dict(df3.values)
d3

{'Aakash': 12, 'Tanvi': 22, 'Rohan': 27, 'Sudarsan': 23, 'John': 56}

11. Create two separate Data Frame s A and B, and perform the following operations on them.

a. Concatenate the two Data Frame s to a new Data Frame C.

b. Split the Data Frame C row wise. 

c. Split the Data Frame column wise based on a condition. For example - columns values greater than 10, column values less than 10, etc.

In [124]:
A = pd.DataFrame([1,2,3,4,5])
B = pd.DataFrame([6,7,8,9,10])

In [130]:
C = pd.concat([A,B],ignore_index = True)
C

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [133]:
#[start:end, start:end]
#[row:coulmn]
df1 = C.iloc[:5,:]
df1

   0
0  1
1  2
2  3
3  4
4  5

In [134]:
df2 = C.iloc[5:,:]
df2

    0
5   6
6   7
7   8
8   9
9  10

12. Create a Data Frame with columns Name and Age. Perform the following operations.

a. Write a sample code to search for the Name/Names where Age is 20. 

b. Sort the Data Frame in ascending order of ages. 

c. Using Python loops, print the ages from the data frame and store it in a set.

In [139]:
df4 = pd.DataFrame({'Name':['Aakash','Sudarsan','Sumana','Mounika','Rohan'],
                   'Age':[20,22,25,20,24]})
df4

       Name  Age
0    Aakash   20
1  Sudarsan   22
2    Sumana   25
3   Mounika   20
4     Rohan   24

In [140]:
df4[df4.Age == 20 ]

      Name  Age
0   Aakash   20
3  Mounika   20

In [141]:
df4.sort_values(by = 'Age')

       Name  Age
0    Aakash   20
3   Mounika   20
1  Sudarsan   22
4     Rohan   24
2    Sumana   25

In [145]:
li = []
l = len(df4)
for i in range(l):
    li.append(df4.loc[i,'Age'])
    
print(li)
#unordered, unchangeable, do not allow duplicates
set1 = set(li)
print(set1)

[20, 22, 25, 20, 24]
{24, 25, 20, 22}